from workflow import app
from datetime import datetime, timedelta
import argparse
from langchain_core.messages import HumanMessage
from langchain.prompts import PromptTemplate

from model import doubao_llm

template = '''
你好豆包，我是{name}，你应该叫我什么
'''
prompt = PromptTemplate.from_template(template).format(name="教主")
prompt = '''
你是一个资深的金融、财务领域专家，现在政府机关请你调查以下这家公司
公司代码: 600310

【一】基本情况与生意特征（根据财务最近5期）：
Empty DataFrame
Columns: []
Index: []

【二】核心逻辑 & 业务分析：
请结合上述数据，分析“市场空间、竞争格局、成长驱动、公司优势”。

【三】估值计算（PE、PB 等）：
                   pe     pe_ttm      pb
trade_date
2020-10-31    20.6687    35.0119  1.4931
2020-11-30    22.5229    38.1528  1.6270
2020-12-31    31.2044    52.8589  1.6642
2021-01-31    25.5371    43.2587  1.3619
2021-02-28    26.9710    45.6876  1.4384
2021-03-31    18.3954    18.3954  2.0798
2021-04-30    16.8995    30.3035  2.1478
2021-05-31    17.1017    30.6660  2.2606
2021-06-30    17.0612    30.5935  2.2553
2021-07-31    15.6866    28.1286  2.0736
2021-08-31    16.6165    22.9432  2.0595
2021-09-30    24.5811    33.9404  3.0467
2021-10-31    27.6347    34.8615  2.3832
2021-11-30    23.3465    29.4519  2.0134
2021-12-31    27.3488    34.5008  2.3585
2022-01-31    22.1554    27.9493  1.9106
2022-02-28    22.7271    28.6706  1.9600
2022-03-31    62.8260    62.8260  1.5755
2022-04-30    57.2415    19.3055  1.4790
2022-05-31    63.6637    21.4715  1.6583
2022-06-30    63.8498    21.5342  1.6631
2022-07-31    64.9667    21.9109  1.6922
2022-08-31    63.6637    30.5096  1.6307
2022-09-30    56.4038    27.0305  1.4448
2022-10-31    53.7977    28.0118  1.4243
2024-03-31  2903.4199  2903.4199  1.6119
2024-04-30  2841.4566  2814.9010  1.6060
2024-08-31  3160.1247   552.1161  1.7687
2024-09-30  3655.8305   638.7226  2.0461
2024-10-31  4647.2422    17.9061  2.2700
2024-11-30  4328.5741    16.6782  2.1143
2024-12-31  4036.4618    15.5527  1.9716
2025-01-31  3593.8673    13.8474  1.7554
2025-02-28  3824.0164    14.7341  1.8679
2025-03-31   101.2232   101.2232  2.1289
2025-04-30    99.1289   119.3735  2.2363

【四】技术面 & 近期走势（最新值）：
ma20:4.19; ma60:4.28; macd:0.02; macd_signal:0.02; macd_hist:0.00; rsi14:49.06; turnover:0.61

【五】机构调研亮点：
事件：1）公司发布2024 年年报，2024 年公司实现营收39.32 亿元，同比下滑76.48%（主. 因剥离油品业务），实现归母净利润0.63 亿元， 去年同期为0.02 亿元，
油品业务剥离致营收同比减少，来水转好和公允价值变动损益带动业绩大幅. 增长。2024 年前三季度公司实现营业收入29.17 亿元，同比减少80.27%；.
主营业务分行业、分产品、分地区、分销售模式情况的说明. 1)报告期内占公司主营业务收入10%以上的为电力业务，电力业务占公司主营业务收. 入的98.45

请整合输出分析结论。
'''


prompt = "分析一下今天运势"
# import time
# time.sleep(20)
print("开始调用")
# analysis_chain = prompt | doubao_llm
print(doubao_llm.invoke(prompt))
